konf/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

konf/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

konf/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

konf/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОкончаниеДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбоненсткаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

konf/src/Documents/РеализацияТоваровУслуг/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
		Ответственный = Пользователи.ТекущийПользователь();
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
		КонецЕсли; 
		
		//Дьяков Г.А. 16.01.2023 
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
			ЗаполнитьРеквизитыШапки(ДанныеЗаполнения);
			ВыполнитьАвтозаполнение(); 
		КонецЕсли;      
		

	КонецПроцедуры 
	
	Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
		Если ОбменДанными.Загрузка Тогда
			Возврат;
		КонецЕсли;
		
		СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
		
	КонецПроцедуры
	
	Процедура ОбработкаПроведения(Отказ, Режим)
		
		АбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
		
		Движения.ОбработкаЗаказов.Записывать = Истина;
		Движения.ОстаткиТоваров.Записывать = Истина;
		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина; //Дьяков 26.12.2023, пишем в регистр РН ВКМ_ВыполненныеКлиентуРаботы	
		
		Движение = Движения.ОбработкаЗаказов.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		Движение.Заказ = Основание;
		Движение.СуммаОтгрузки = СуммаДокумента;
		
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Движение = Движения.ОстаткиТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Контрагент = Контрагент;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Сумма = ТекСтрокаТовары.Сумма;
			Движение.Количество = ТекСтрокаТовары.Количество;
		КонецЦикла;
		
		//Дьяков 26.12.2023, пишем в регистр РН ВКМ_ВыполненныеКлиентуРаботы	
		Для Каждого ТекСтрокаУслуги Из Услуги Цикл
			Если ТекСтрокаУслуги.Номенклатура <> АбонентскаяПлата Тогда 
				Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Клиент = Контрагент;
				Движение.Договор = Договор;
				Движение.СуммаКОплате = ТекСтрокаУслуги.Сумма;
				Движение.КоличествоЧасов = ТекСтрокаУслуги.Количество;
			КонецЕсли;
		КонецЦикла;  
		
	КонецПроцедуры
	
	#КонецОбласти
	
	#Область СлужебныеПроцедурыИФункции 
	
	Процедура ЗаполнитьРеквизитыШапки(ДанныеЗаполнения);
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения[0]);
		
	КонецПроцедуры  
	
	Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗаказПокупателя.Организация КАК Организация,
		|	ЗаказПокупателя.Контрагент КАК Контрагент,
		|	ЗаказПокупателя.Договор КАК Договор,
		|	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
		|	ЗаказПокупателя.Товары.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		Номенклатура КАК Номенклатура,
		|		Количество КАК Количество,
		|		Цена КАК Цена,
		|		Сумма КАК Сумма
		|	) КАК Товары,
		|	ЗаказПокупателя.Услуги.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		Номенклатура КАК Номенклатура,
		|		Количество КАК Количество,
		|		Цена КАК Цена,
		|		Сумма КАК Сумма
		|	) КАК Услуги
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Не Выборка.Следующий() Тогда
			Возврат;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
		
		ТоварыОснования = Выборка.Товары.Выбрать();
		Пока ТоварыОснования.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
		КонецЦикла;
		
		УслугиОснования = Выборка.Услуги.Выбрать();
		Пока ТоварыОснования.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
		КонецЦикла;
		
		Основание = ДанныеЗаполнения;
		
	КонецПроцедуры
	
	Процедура ВыполнитьАвтозаполнение() Экспорт
		
		НоменклатураАбонентскийДоговор = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
		НоменклатураРаботыСотрудника = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
		
		Если НЕ ЗначениеЗаполнено(НоменклатураАбонентскийДоговор) 
			Или НЕ ЗначениеЗаполнено(НоменклатураРаботыСотрудника) Тогда
			ОбщегоНазначения.СообщитьПользователю("Заполните константы ""Номенклатура абонентский договор"" и ""Номенклатура работы сотрудника""");
			ЗаписьЖурналаРегистрации("Не заполнены константы ВКМ_АбоненсткаяПлата и ВКМ_РаботыСпециалиста", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.РеализацияТоваровУслуг,,,);  
			Возврат;
		КонецЕсли;
		
		Услуги.Очистить();
		
		АктуальныйДоговор = ВернутьРезультатПроверкиПериодаДействияДоговора();
		
		Если ЗначениеЗаполнено(АктуальныйДоговор) и НЕ АктуальныйДоговор Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Для договора %1 с контрагентом %2 не может быть сформирован документ ""Реализатия товаров и услуг"", т.к. срок действия договора не актуален.",Договор,Контрагент));
			ЗаписьЖурналаРегистрации("Договор с истекшим сроком действия.", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.РеализацияТоваровУслуг,,,);  
			Возврат;
		КонецЕсли;
		
		ВыборкаАбонПлата = ВернутьСуммуАбонПлатыДоговора();
		ВыборкаАбонПлата.Следующий();
		
		Если ЗначениеЗаполнено(ВыборкаАбонПлата.АбоненсткаяПлата) Тогда
			
			СтрокаТЧ = Услуги.Добавить();
			СтрокаТЧ.Количество = 1;
			СтрокаТЧ.Цена = ВыборкаАбонПлата.АбоненсткаяПлата;
			СтрокаТЧ.Номенклатура = НоменклатураАбонентскийДоговор;
			СтрокаТЧ.Сумма = ВыборкаАбонПлата.АбоненсткаяПлата*СтрокаТЧ.Количество;
			
		КонецЕсли; 
		
		
		ВыборкаВыполненыеРаботы = ВернутьВыполненыеРаботы();
		ВыборкаВыполненыеРаботы.Следующий();
		
		Если ЗначениеЗаполнено(ВыборкаВыполненыеРаботы.СуммаКОплате) Тогда
			
			СтрокаТЧ = Услуги.Добавить();	
			СтрокаТЧ.Номенклатура = НоменклатураРаботыСотрудника; 
			СтрокаТЧ.Цена = ВыборкаВыполненыеРаботы.СуммаКОплате/ВыборкаВыполненыеРаботы.Количество;
			СтрокаТЧ.Количество = ВыборкаВыполненыеРаботы.Количество;
			СтрокаТЧ.Сумма = ВыборкаВыполненыеРаботы.СуммаКОплате;
			
		КонецЕсли;      
		
		СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
		
		
	КонецПроцедуры
	
	Функция ВернутьРезультатПроверкиПериодаДействияДоговора() 
		
		РезультатПроверкиПериодаДоговора = Ложь;
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВЫБОР
		               |		КОГДА ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
		               |				И (&Дата МЕЖДУ НАЧАЛОПЕРИОДА(ДоговорыКонтрагентов.ВКМ_НачалоДействия, ДЕНЬ) И КОНЕЦПЕРИОДА(ДоговорыКонтрагентов.ВКМ_ОкончаниеДействия, ДЕНЬ))
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ КАК АктуальныйПериодДествияДоговора
		               |ИЗ
		               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		               |ГДЕ
		               |	НЕ ДоговорыКонтрагентов.ПометкаУдаления
		               |	И ДоговорыКонтрагентов.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Договор);
		Запрос.УстановитьПараметр("Дата", Дата);

		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Количество() > 0 Тогда
			
			Выборка.Следующий();
			
			РезультатПроверкиПериодаДоговора = Выборка.АктуальныйПериодДествияДоговора;	
			
		КонецЕсли;
		
		Возврат РезультатПроверкиПериодаДоговора;
		
	КонецФункции
	
	Функция ВернутьСуммуАбонПлатыДоговора();
		
		Запрос = Новый Запрос();
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ДоговорыКонтрагентов.ВКМ_АбоненсткаяПлата КАК АбоненсткаяПлата
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Договор";
		Запрос.УстановитьПараметр("Договор", Договор);
		
		Возврат Запрос.Выполнить().Выбрать(); 
		
	КонецФункции
	
	Функция ВернутьВыполненыеРаботы(); 
		
		Запрос = Новый Запрос();
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор КАК Договор,
		               |	ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовПриход КАК Количество,
		               |	ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеПриход КАК СуммаКОплате
		               |ИЗ
		               |	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&НачалоМесяца, &КонецМесяца, , Договор = &Договор) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты
		               |ГДЕ
		               |	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор = &Договор";
				
		Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Дата)); 
		Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Дата)); 
		Запрос.УстановитьПараметр("Договор", Договор); 
		
		Возврат Запрос.Выполнить().Выбрать(); 
		
	КонецФункции

		
	#КонецОбласти
	
#КонецЕсли
